cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xd.svd
        <!-- REGISTER "SPSR" -->
        <register>
          <name>SPSR</name>
          <description>Special Port Setting Register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x0000001C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0C" -->
            <field>
              <name>USB0C</name>
              <description>USB (ch.0) Pin Setting Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MAINXC" -->
            <field>
              <name>MAINXC</name>
              <description>Main Clock (Oscillation) Pin Setting Register</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR00" -->
        <register>
          <name>EPFR00</name>
          <description>Extended Pin Function Setting Register 00</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x000102F7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWDEN" -->
            <field>
              <name>SWDEN</name>
              <description>Serial Wire Debug Function Select bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBP0E" -->
            <field>
              <name>USBP0E</name>
              <description>USB ch.0 Function Select bit 1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBOUTE" -->
            <field>
              <name>SUBOUTE</name>
              <description>Sub clock divide output function select bit</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTCCOE" -->
            <field>
              <name>RTCCOE</name>
              <description>RTC clock output select bit</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CROUTE" -->
            <field>
              <name>CROUTE</name>
              <description>Internal high-speed CR Oscillation Output Function Select bit</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NMIS" -->
            <field>
              <name>NMIS</name>
              <description>NMIX Function Select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR01" -->
        <register>
          <name>EPFR01</name>
          <description>Extended Pin Function Setting Register 01</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IC03S" -->
            <field>
              <name>IC03S</name>
              <description>IC03 Input Select bits</description>
              <msb>31</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC02S" -->
            <field>
              <name>IC02S</name>
              <description>IC02 Input Select bits</description>
              <msb>28</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC01S" -->
            <field>
              <name>IC01S</name>
              <description>IC01 Input Select bits</description>
              <msb>25</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC00S" -->
            <field>
              <name>IC00S</name>
              <description>IC00 Input Select bits</description>
              <msb>22</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRCK0S" -->
            <field>
              <name>FRCK0S</name>
              <description>FRCK0 Input Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0S" -->
            <field>
              <name>DTTI0S</name>
              <description>DTTIX0 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGTRG0" -->
            <field>
              <name>IGTRG0</name>
              <description>IGTRG0 Input Select bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0C" -->
            <field>
              <name>DTTI0C</name>
              <description>DTTIX0 Function Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO05E" -->
            <field>
              <name>RTO05E</name>
              <description>RTO05 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO04E" -->
            <field>
              <name>RTO04E</name>
              <description>RTO04 Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO03E" -->
            <field>
              <name>RTO03E</name>
              <description>RTO03 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO02E" -->
            <field>
              <name>RTO02E</name>
              <description>RTO02 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO01E" -->
            <field>
              <name>RTO01E</name>
              <description>RTO01 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO00E" -->
            <field>
              <name>RTO00E</name>
              <description>RTO00 Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR04" -->
        <register>
          <name>EPFR04</name>
          <description>Extended Pin Function Setting Register 04</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3C3F7C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB3S" -->
            <field>
              <name>TIOB3S</name>
              <description>TIOB3 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3E" -->
            <field>
              <name>TIOA3E</name>
              <description>TIOA3 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3S" -->
            <field>
              <name>TIOA3S</name>
              <description>TIOA3 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB2S" -->
            <field>
              <name>TIOB2S</name>
              <description>TIOB2 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA2E" -->
            <field>
              <name>TIOA2E</name>
              <description>TIOA2 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB1S" -->
            <field>
              <name>TIOB1S</name>
              <description>TIOB1 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1E" -->
            <field>
              <name>TIOA1E</name>
              <description>TIOA1 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1S" -->
            <field>
              <name>TIOA1S</name>
              <description>TIOA1 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB0S" -->
            <field>
              <name>TIOB0S</name>
              <description>TIOB0 Input Select bits</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA0E" -->
            <field>
              <name>TIOA0E</name>
              <description>TIOA0 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR05" -->
        <register>
          <name>EPFR05</name>
          <description>Extended Pin Function Setting Register 05</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB7S" -->
            <field>
              <name>TIOB7S</name>
              <description>TIOB7 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7E" -->
            <field>
              <name>TIOA7E</name>
              <description>TIOA7 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7S" -->
            <field>
              <name>TIOA7S</name>
              <description>TIOA7 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB6S" -->
            <field>
              <name>TIOB6S</name>
              <description>TIOB6 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA6E" -->
            <field>
              <name>TIOA6E</name>
              <description>TIOA6 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB5S" -->
            <field>
              <name>TIOB5S</name>
              <description>TIOB5 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5E" -->
            <field>
              <name>TIOA5E</name>
              <description>TIOA5 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5S" -->
            <field>
              <name>TIOA5S</name>
              <description>TIOA5 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB4S" -->
            <field>
              <name>TIOB4S</name>
              <description>TIOB4 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA4E" -->
            <field>
              <name>TIOA4E</name>
              <description>TIOA4 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
