cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xd.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LSCRP" -->
    <peripheral>
      <name>LSCRP</name>
      <description>Low-speed CR Prescaler Register</description>
      <version>A</version>
      <groupName>LSCRP</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCR_PRSLD" -->
        <register>
          <name>LCR_PRSLD</name>
          <description>Low-speed CR Prescaler Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCR_PRSLD" -->
            <field>
              <name>LCR_PRSLD</name>
              <description>Low-speed CR Prescaler Load</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CLK_GATING" -->
    <peripheral>
      <name>CLK_GATING</name>
      <description>Peripheral Clock Gating Registers</description>
      <version>A</version>
      <groupName>CLK_GATING</groupName>
      <baseAddress>0x4003C100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CKEN0" -->
        <register>
          <name>CKEN0</name>
          <description>Peripheral Function Clock Control Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x130FFFFF</resetValue>
          <resetMask>0x130FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GIOCK" -->
            <field>
              <name>GIOCK</name>
              <description>Software clock control of GPIO/Fast GPIO function</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSTCCK" -->
            <field>
              <name>DSTCCK</name>
              <description>Software clock control of DSTC function</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMACK" -->
            <field>
              <name>DMACK</name>
              <description>Supplying and gating settings of DMAC operation clock</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK" -->
            <field>
              <name>ADCCK</name>
              <description>Settings for operation clock supplying and gating to A/D converters</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK" -->
            <field>
              <name>MFSCK</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST0" -->
        <register>
          <name>MRST0</name>
          <description>Peripheral Function Reset Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x030FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSTCRST" -->
            <field>
              <name>DSTCRST</name>
              <description>Reset control of DSTC</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMARST" -->
            <field>
              <name>DMARST</name>
              <description>Reset control of DMAC</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST" -->
            <field>
              <name>ADCRST</name>
              <description>Reset control of A/D converters</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST" -->
            <field>
              <name>MFSRST</name>
              <description>Control of software reset of multi-function serial interface ch.15</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
